Repository: CofficLab/Lumi
Catalog: Plugins/LLMProviderMiniMaxPlugin/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Configure your MiniMax TokenPlan API Key below, then resend your message.
zh_hans: 请在下方填写 MiniMax TokenPlan API Key 后重新发送消息。
zh_hk: 請於下方填寫 MiniMax TokenPlan API Key 後重新發送訊息。

source: Contributes MiniMax TokenPlan models and MiniMax-specific chat error renderers.
zh_hans: 提供 MiniMax TokenPlan 模型与 MiniMax 专属聊天错误渲染器。
zh_hk: 提供 MiniMax TokenPlan 模型與 MiniMax 專屬聊天錯誤渲染器。

source: Copy
zh_hans: 复制
zh_hk: 複製

source: Enter MiniMax TokenPlan API Key
zh_hans: 输入 MiniMax TokenPlan API Key
zh_hk: 輸入 MiniMax TokenPlan API Key

source: Error
zh_hans: 错误
zh_hk: 錯誤

source: Get API Key on MiniMax Open Platform
zh_hans: 前往 MiniMax 开放平台获取 API Key
zh_hk: 前往 MiniMax 開放平臺取得 API Key

source: Hide API Key
zh_hans: 隐藏 API Key
zh_hk: 隱藏 API Key

source: MiniMax request failed
zh_hans: MiniMax 请求失败
zh_hk: MiniMax 請求失敗

source: MiniMax Token Plan (Anthropic-compatible)
zh_hans: MiniMax Token Plan 订阅（兼容 Anthropic 接口）
zh_hk: MiniMax Token Plan 訂閱（相容 Anthropic 介面）

source: MiniMax TokenPlan API Key invalid or expired
zh_hans: MiniMax TokenPlan API Key 无效或已过期
zh_hk: MiniMax TokenPlan API Key 無效或已過期

source: MiniMax TokenPlan API Key required
zh_hans: 需要 MiniMax TokenPlan API Key
zh_hk: 需要 MiniMax TokenPlan API Key

source: Raw error details
zh_hans: 原始错误详情
zh_hk: 原始錯誤詳情

source: Received Data
zh_hans: 接收数据
zh_hk: 接收資料

source: Request / Response Details
zh_hans: 请求 / 响应详情
zh_hk: 請求 / 回應詳情

source: Sending Data
zh_hans: 发送数据
zh_hk: 發送資料

source: Show API Key
zh_hans: 显示 API Key
zh_hk: 顯示 API Key

source: Show raw error details
zh_hans: 显示原始错误详情
zh_hk: 顯示原始錯誤詳情

source: Show request and response details
zh_hans: 显示请求与响应详情
zh_hk: 顯示請求與回應詳情

source: This model is not included in your Token Plan
zh_hans: 当前套餐不含该模型
zh_hk: 當前方案不含此模型

source: Use a TokenPlan API Key from the MiniMax open platform. Update it below, then resend your message.
zh_hans: 请使用 MiniMax 开放平台 TokenPlan 套餐生成的 API Key，更新后重新发送消息。
zh_hk: 請使用 MiniMax 開放平臺 TokenPlan 方案產生的 API Key，更新後重新發送訊息。
